In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data/hous_final_pivoted.csv', index_col=False, low_memory=False)

In [3]:
set([i for i in df.variable if 'rntvac' in i])

{'rntvacrt', 'rntvacu'}

In [4]:
df.loc[(df.geoid == 'BK09')&(df.variable == 'RntVacRt'.lower()), ['c','e','m','p','z']]

                c                   e         m   p   z
143002  57.595204  1.2625445127873098  1.196187 NaN NaN

In [6]:
dff = df.head()

In [16]:
dff.loc[:,'c'] = dff['c'].round(1)

In [17]:
dff

,geotype,geogname,geoid,dataset,variable,c,e,m,p,z
0,NTA2010,Allerton-Pelham Gardens,BX31,Y2013-2017,r1kt1249,17.9,566.0,166.385095,14.062112,3.998902
1,NTA2010,Bedford Park-Fordham North,BX05,Y2013-2017,r1kt1249,6.0,5033.0,493.928132,27.311700,2.624117
2,NTA2010,Belmont,BX06,Y2013-2017,r1kt1249,10.0,2008.0,330.352842,22.857143,3.693651
3,NTA2010,Bronxdale,BX07,Y2013-2017,r1kt1249,8.2,2706.0,366.025955,22.686117,2.999217
4,NTA2010,Claremont-Bathgate,BX01,Y2013-2017,r1kt1249,8.4,2166.0,298.673735,20.499716,2.798064

In [36]:
df.loc[(df.geoid == '5029103')&(df.variable == 'hovacrt'), 
       ['c','e','m','p','z']]

               c    e    m   p   z
13049  99.184131  1.9  3.1 NaN NaN

In [37]:
m = 2.4
e = 2.8
m/1.645/e*100

52.10594876248372